{
  "templates": [
    {
      "id": "1754573500096",
      "name": "Mapping Test",
      "subject": "Hello [first_name]",
      "body": "Hi [first_name], \nI’m Rahul, founder of Neurality Health AI. We help forward-thinking dental organizations harness the power of AI to streamline patient care, reduce administrative burden, and improve clinical outcomes. \n\nOur platform uses advanced AI models to analyze patient data, automate routine tasks, and provide actionable insights for your team. \n\nThe result? \n\nMore time for your staff to focus on what matters most — **delivering exceptional patient experiences**. \n\nHere’s what you can expect from Neurality Health AI: \n• **Improved Efficiency:** Automate repetitive admin work and reduce operational costs. \n• **Smarter Decisions:** Leverage predictive analytics to guide patient care. \n• **Enhanced Patient Engagement:** Personalized communication tools to keep patients informed and satisfied. I’d love to show you how Neurality Health AI can integrate seamlessly into your workflows and help your organization thrive. \n\n**Book a 20-minute demo** at your convenience, and let’s explore what’s possible. Looking forward to connecting. \nRahul \nFounder & CEO Neurality Health AI\n",
      "createdAt": "2025-08-07T13:31:40.096Z",
      "updatedAt": "2025-08-20T05:14:56.604Z"
    },
    {
      "id": "1760724167534",
      "name": "HLTH1",
      "subject": "Hello [first_name]",
      "body": "Hello [first_name], I am Rahul. \nThis is a test email you will recieve. Here is how you can reach out to us, we usually prefer the calendly scheduling features so lets connect and meet face to face.\n\nThis will help us understand the requirements of your practice. I have no idea what to type next but I have to type something to simulate how an actual message would look like. \n\nhere is a link if you care: https://www.youtube.com/watch?v=RGaW82k4dK4\n\nI hope you enjoyed it.\nyours faithfully\nAnish",
      "createdAt": "2025-10-17T18:02:47.534Z"
    }
  ]
}