[
  {
    "id": 1,
    "title": "Filter Non-Null Email Entries",
    "description": "In the outbound component, display only those entries whose email entry is not null.",
    "status": "completed"
  },
  {
    "id": 2,
    "title": "Add Email Count Column",
    "description": "Display a column showing the number of emails sent to each email address (fetched from Supabase).",
    "status": "completed"
  },
  {
    "id": 3,
    "title": "Add Email Template Dropdown",
    "description": "For each row, provide a dropdown (using shadcn/ui select) to choose an email template (placeholder values: 1, 2, 3, 4, 5).",
    "status": "completed"
  },
  {
    "id": 4,
    "title": "Add Sender Email Dropdown",
    "description": "Provide a dropdown to select the sender email ID (placeholder values: 1, 2, 3, 4, 5).",
    "status": "completed"
  },
  {
    "id": 5,
    "title": "Add Send/Draft Mode Selection",
    "description": "Add a dropdown to choose between sending the email directly or creating a draft.",
    "status": "completed"
  },
  {
    "id": 6,
    "title": "Implement Send/Draft Functionality",
    "description": "If 'Send Directly' is selected, allow scheduling via a date-time picker input or immediate send. If 'Create Draft' is selected, save as draft without sending.",
    "status": "completed"
  },
  {
    "id": 7,
    "title": "Improve UI/UX for Responsiveness and Scheduling Column",
    "description": "Make the UI more responsive for mobile devices and simplify the scheduling column for better UX.",
    "status": "completed"
  },
  {
    "id": 8,
    "title": "Add PST to IST Converter",
    "description": "Add a PST to IST converter above the table in desktop mode and beside the Outbound header in mobile. Show current time in both zones, allow input in either to update the other, to help users plan scheduling.",
    "status": "completed"
  },
  {
    "id": 9,
    "title": "Implement Pagination and Lazy Loading",
    "description": "Paginate and lazy load entries (10 per page, up to 8000 total). Use a hybrid input/dropdown for page size, custom footer with page info, prev/next, direct jump, and breadcrumbs for long page lists. Reference SupabaseTable for context.",
    "status": "completed"
  },
  {
    "id": 10,
    "title": "Add Search Bar with Highlighting",
    "description": "Add a search bar to Outbound.jsx that matches as you type and highlights matches across columns. Reference SupabaseTable for context.",
    "status": "completed"
  },
  {
    "id": 11,
    "title": "Add Row Selection and Bulk Actions Bar",
    "description": "Add a select column with checkboxes for each row. When entries are selected, show a select menu bar above the table header with options for bulk selection, template/email/send mode assignment, and scheduling. Reference SupabaseTable for context.",
    "status": "completed"
  },
  {
    "id": 12,
    "title": "Improve UploadFile UI and Haptic Feedback",
    "description": "Improve the UI of the UploadFile component: make it more well-spaced and attractive, and add tactile/haptic feedbacks upon interaction to improve UX.",
    "status": "completed"
  },
  {
    "id": 13,
    "title": "Add Optional Additional Mapping in UploadFile",
    "description": "Inside UploadFile, add an expandable component labeled 'Additional Mapping' where columns Email, Phone Number, and First Name can be optionally mapped to Supabase columns. The existing three mappings (Practice Name, Practice Website URL, Owner Full Name) remain compulsory; the additional ones are optional.",
    "status": "completed"
  },
  {
    "id": 14,
    "title": "Create Templates and IDs Sidebar Component",
    "description": "Create a new sidebar component below Outbound called 'Templates and IDs' (keep it blank for now).",
    "status": "completed"
  },
  {
    "id": 15,
    "title": "Build Templates and IDs Component",
    "description": "Create a placeholder area for both the ID section and the Template section in the Templates and IDs component.",
    "status": "completed"
  },
  {
    "id": 16,
    "title": "Create Templates Div with Create Button and Form",
    "description": "Create a templates div at the top, full width and mobile responsive, with a Create button. On clicking, expand the div to show fields: Template Name, Subject, Body, and Save/Cancel buttons below.",
    "status": "completed"
  },
  {
    "id": 17,
    "title": "Create JSON File for Template Storage",
    "description": "Create a JSON file to store template responses when the Save button is clicked in the templates div.",
    "status": "completed"
  },
  {
    "id": 18,
    "title": "List Templates in Templates Div",
    "description": "Below the Create button in the templates div, list all templates stored in the JSON file, displaying only the template name.",
    "status": "completed"
  },
  {
    "id": 19,
    "title": "Add Delete Button for Templates",
    "description": "In the list of templates in the templates div, add a Delete button next to each template name to delete the entry from the JSON file.",
    "status": "completed"
  },
  {
    "id": 20,
    "title": "Add Edit Functionality for Templates",
    "description": "When we click on the template name in the list of Saved templates, an edit div should open up allowing to update the template.",
    "status": "completed"
  }
]
